{
	"basics": {
		"name": "Datheng Wang",
		"label": "DevOps Engineer | Cloud Engineer",
		"email": "wmsisme@outlook.com",
		"phone": "+86 13662242379",
		"website": "https://datheng.github.io",
		"url": "https://datheng.github.io",
		"urlLastUpdated": "https://github.com/datheng/datheng.github.io/releases",
		"picture-TODO": "",
		"picture": "",
		"image": "",
		"theme": "default",
		"summary": "Ambitious, passionate, and self-motivated Full Stack Developer with expertise in cloud computing and DevOps culture & practice, and cloud-native solutions, driven by challenges, growth, and innovation. Seeking opportunities to build impactful solutions and deliver value to businesses and users.",
		"summaries": [
			"Passionate, technology-driven, and self-motivated Full Stack Developer with expertise in cloud computing and DevOps culture & practice, and cloud-native solutions. My core mission is to transform systems into a highly resilient, self-healing entity through advanced architectural design, deep automation, and cutting-edge engineering practices.",
			"Building 'unbreakable' systems and enjoy the thrill of solving complex challenges with technology"
		],
		"summaries_md": [
			"**Passionate, technology-driven, and self-motivated Full Stack Developer** with expertise in cloud computing and **DevOps** culture & practice, and **cloud-native** solutions. My core mission is to transform systems into a highly resilient, self-healing entity through advanced architectural design, deep automation, and cutting-edge engineering practices.",
			"Building **unbreakable** systems and enjoy the thrill of solving complex challenges with technology"
		],
		"location": {
			"city": "Shenzhen, Guangodong Province",
			"region": "China"
		},
		"profiles": [
			{
				"network": "GitHub",
				"username": "datheng",
				"url": "https://github.com/datheng",
				"projects": "https://github.com/datheng#-things-ive-done-for-myself-but-may-be-helpful-for-others"
			},
			{
				"network": "LinkedIn",
				"username": "datheng",
				"url": "https://linkedin.com/in/datheng"
			},
			{
				"network": "Credly",
				"username": "datheng",
				"url": "https://www.credly.com/users/datheng/"
			},
			{
				"network": "Website",
				"username": "datheng.github.io"
			},
			{
				"network": "CV",
				"username": "CV",
				"url": "https://datheng.github.io/DathengWang-CV.pdf"
			},
			{
				"network": "Mindmap",
				"username": "mindmap",
				"url": "https://datheng.github.io/mindmap"
			}
		]
	},
	"work": [
		{
			"company": "Shenzhen Carrot IT Co., Ltd.",
			"position": "Technical Director",
			"startDate": "2012-12",
			"summary": "Passionate, technology-driven System Architect and Technical Director,  play a critical role in making applications and infrastructure services  Reliable, Visible, Resilience,  Self-healing  to stakeholders for daily operation, troubleshooting, performance analysis, capacity planning  through advanced architectural design, deep automation, and cutting-edge engineering practices.",
			"summary_md": "Passionate, technology-driven System Architect and Technical Director,  play a critical role in making applications and infrastructure services  **Reliable**, **Visible**, **Resilience**,  **Self-healing**  to stakeholders for daily operation, troubleshooting, performance analysis, capacity planning  through advanced architectural design, deep automation, and cutting-edge engineering practices.",
			"highlights": [
				"Practical experience with Chaos Engineeringusing tools like Chaos Monkey, Chaos Knife, KubeInvaders, etc.",
				"Hands-on experience with containerization(Docker) and container orchestration(Kubernetes/EKS).",
				"Familiarity with Cl/CD pipelines and tools(e.g., Jenkins, GitLab Cl, AWS CodePipeline).",
				"In-depth understanding of distributed systems, networking protocols, and system performance tuning.",
				"Mentored a Frontend Developer and a Backend Developer, supporting their growth and technical skills",
				"A relentless curiosity and passion for learning new technologies demonstrated through personal projects, technical blogs, open-source contributions, or community engagement.",
				"Exceptional problem-solving skills, with the ability to remain calm and logical under pressure to resolve complex issues."
			],
			"responsibilities": [
				"Architecture Design & Optimization: Spearhead the design, implementation, and optimization of High Availability (HA) and Disaster Recovery (DR) solutions across on-premise and public cloud environments, encompassing multi-AZ (Availability Zone) and multi-region architectures to eliminate single points of failure and ensure business continuity.",
				"​Infrastructure as Code (IaC) Leadership: Champion and drive Infrastructure as Code (IaC) practices, leveraging tools such as Terraform, ARM templates, and AWS CloudFormation to automate, version-control, and ensure repeatable, idempotent provisioning of all infrastructure components, achieving consistency and efficiency.",
				"​Observability & Monitoring Enhancement: Enhance system observability by establishing comprehensive metrics collection, alerting mechanisms, and centralized logging using platforms like Prometheus, Grafana, Alertmanager, and OpenSearch (ELK stack), enabling real-time performance analysis, proactive issue detection, and rapid troubleshooting.",
				"Automation & Operational Efficiency: Develop robust automation scripts and tools using Ansible, Bash, and Python to eliminate manual, repetitive tasks, thereby streamlining operational workflows, accelerating incident response, and improving recovery times.",
				"​Incident Management & Continuous Improvement: Participate in on-call rotations for critical incidents and lead blameless post-mortem processes to perform deep-dive root cause analysis, driving actionable insights and continuous improvement across systems and processes.",
				"Software Engineering Principles & CI/CD: Apply strong software development domain knowledge, including design patterns, code structure, and programming languages, with expertise in continuous integration and deployment (CI/CD) pipelines using Git, GitHub/GitLab, Jenkins, and ArgoCD",
				"Team Leadership & Mentorship: Lead and mentor a team of engineers, fostering a culture of collaboration, continuous learning, and professional growth, while ensuring alignment with organizational goals and technical excellence.",
				"Communication & ITSM Integration: Possess excellent written and verbal communication skills, with experience in ITOM/ITSM integration, specifically ServiceNow ITOM for event management and operational intelligence, alongside strong people management capabilities.",
				"DevOps & Modern Ops Practices: Maintain deep awareness and implementation expertise in DevOps, DevSecOps, GitOps, and AIOps strategies, fostering a culture of automation, collaboration, and continuous delivery."
			],
			"responsibilities_md": [
				"**Architecture Design & Optimization**: Spearhead the design, implementation, and optimization of High Availability (HA) and Disaster Recovery (DR) solutions across on-premise and public cloud environments, encompassing multi-AZ (Availability Zone) and multi-region architectures to eliminate single points of failure and ensure business continuity.",
				"**​Infrastructure as Code (IaC) Leadership**: Champion and drive Infrastructure as Code (IaC) practices, leveraging tools such as Terraform, ARM templates, and AWS CloudFormation to automate, version-control, and ensure repeatable, idempotent provisioning of all infrastructure components, _achieving consistency and efficiency_.",
				"​**Observability & Monitoring Enhancement**: Enhance system observability by establishing comprehensive metrics collection, alerting mechanisms, and centralized logging using platforms like Prometheus, Grafana, Alertmanager, and OpenSearch (ELK stack), _enabling real-time performance analysis, proactive issue detection, and rapid troubleshooting_.",
				"**Automation & Operational Efficiency**: Develop robust automation scripts and tools using Ansible, Bash, and Python to eliminate manual, repetitive tasks, _thereby streamlining operational workflows, accelerating incident response, and improving recovery times_.",
				"**​Incident Management & Continuous Improvement**: Participate in on-call rotations for critical incidents and lead blameless post-mortem processes to perform deep-dive root cause analysis, _driving actionable insights and continuous improvement across systems and processes_.",
				"**Software Engineering Principles & CI/CD**: Apply strong software development domain knowledge, including design patterns, code structure, and programming languages, with expertise in continuous integration and deployment (CI/CD) pipelines using Git, GitHub/GitLab, Jenkins, and ArgoCD",
				"**Team Leadership & Mentorship**: Lead and mentor a team of engineers, fostering a culture of collaboration, continuous learning, and professional growth, while ensuring alignment with organizational goals and technical excellence.",
				"**Communication & ITSM Integration**: Possess excellent written and verbal communication skills, with experience in ITOM/ITSM integration, specifically ServiceNow ITOM for event management and operational intelligence, alongside strong people management capabilities.",
   			    "**DevOps & Modern Ops Practices**: Maintain deep awareness and implementation expertise in DevOps, DevSecOps, GitOps, and AIOps strategies, fostering a culture of automation, collaboration, and continuous delivery."
			],
			"achievements": [
				"I successfully collaborated with geographically dispersed teams across different countries, adapting communication for time zone/cultural differences during critical incident resolutions.",
				"Build a dual-active architecture with Azure and Alibaba Cloud to support daily processing of over 100,000 orders for the PO system",
				"Build On Premise high availability k8s cluster, implement Kubernetes elastic scaling strategy, and ensure peak Pod startup latency is less than 500ms",
				"Build Proxmox bare metal cluster to support millisecond scale scaling for over 100 containerized applications",
				"Enhance system disaster recovery capability through Chaos Monkey drill, achieving zero business interruption throughout the year",
				"Develop a microservice monitoring system based on Spring Cloud, with an average response time of less than 200ms",
				"Implement Prometheus+ELK log analysis platform, improve fault localization efficiency by 80%",
				"Design Argo CD continuous delivery assembly line to achieve 1000 daily fault free deployments",
				"Standardized deployment through Helm Charts reduces environment consistency error rate by 90%",
				"Implement GitOps practice, reduce configuration drift rate from 15%/week to 0.5%/month"


			],
			"achievements_md": [
				"I successfully collaborated with geographically dispersed teams across different countries, adapting communication for time zone/cultural differences during critical incident resolutions.",
				"Build a **dual-active architecture** with Azure and Alibaba Cloud to support daily processing of over 100,000 orders for the PO system",
				"Build **On Premise high availability k8s cluster**, implement Kubernetes elastic scaling strategy, and ensure peak Pod startup latency is less than 500ms",
				"Build **Proxmox bare metal cluster** to support millisecond scale scaling for over 100 containerized applications",
				"Enhance system disaster recovery capability through Chaos Monkey drill, achieving zero business interruption throughout the year",
				"Develop a microservice monitoring system based on Spring Cloud, with an average response time of less than 200ms",
				"Implement **OpenTelemetry, Prometheus+Grafana+AlertManager and ELK log analysis platform**, improve fault localization efficiency by 80%",
				"Design **Argo CD** continuous delivery assembly line to achieve 1000 daily fault free deployments",
				"Standardized deployment through **Helm Charts** reduces environment consistency error rate by 90%",
				"Implement **GitOps** practice, reduce configuration drift rate from 15%/week to 0.5%/month"
			],
			"skills": [
				"Chaos Engineering",
				"SRE",
				"DevOps",
				"CI/CD",
				"GitOps",
				"Linux",
				"Docker",
				"Kubernetes",
				"Prometheus",
				"OpenTelemetry",
				"Grafana",
				"Azure Cloud",
				"Alibaba Cloud",
				"AWS",
				"EKS",
				"Jenkins",
				"ArgoCD",
				"HELM",
				"Terraform",
				"Ansible",
				"Bash",
				"Python",
				"Java",
				"Spring Boot",
				"Spirng Cloud",
				"ELK"
			]		
		},
		{
			"company": "Walmart (China) Investment Co., Ltd. - Home Office",
			"position": "Manager - Server, Storage & Security",
			"startDate": "2010-12",
			"endDate": "2012-12",
			"summary": "Collaborated with biz development team in China, co-worked with global teams , ensuring seamless alignment between business requirements and technical solutions, like  server operation, storage capacity, application deployment and SRE etc.",
			"summary_md": "**Collaborated** with biz development team in China, co-worked with global teams , ensuring seamless alignment between business requirements and technical solutions, like  server operation, storage capacity, application deployment and SRE etc.",
			"highlights": [
				"Developed a CMS for a gaming system.",
				"Developed and deployed a performance review system used by over 100 employees.",
				"Migrated a legacy system from Docker Compose to Kubernetes.",
				"Contributed to building the design system.",
				"Mentored a Frontend Developer and a Backend Developer, supporting their growth and technical skills",
				"Achievement: Promoted four times in two years — twice the usual pace — recognizing outstanding contributions."
			],
			"responsibilities": [
				"Application Operational Management: Collaborated with development teams throughout the application lifecycle to ensure seamless deployment of new systems, maintaining production-grade quality and zero customer impact.",
				"Change Management: Owned production environment governance under ITIL4 framework, enforcing compliance with Change Management, Incident Management, and Release Management policies.",
				"Incident Management: Conducted proactive monitoring, root cause analysis, and resolution of production incidents, escalating to cross-functional teams when critical business continuity risks emerged.",
				"Environment Patch Management: Executed systematic patching strategies to uphold security posture, ensuring 100% compliance with the latest vulnerability remediation protocols.",
				"Mentored two Management Trainee, accelerating their technical growth and productivity."
			],
			"responsibilities_md": [
				"**Application Operational Management**: Collaborated with development teams throughout the application lifecycle to ensure seamless deployment of new systems, maintaining production-grade quality and zero customer impact.",
				"**Change Management**: Owned production environment governance under ITIL4 framework, enforcing compliance with Change Management, Incident Management, and Release Management policies.",
				"**Incident Management**: Conducted proactive monitoring, root cause analysis, and resolution of production incidents, escalating to cross-functional teams when critical business continuity risks emerged.",
				"**Environment Patch Management**: Executed systematic patching strategies to uphold security posture, ensuring 100% compliance with the latest vulnerability remediation protocols.",
				"**Mentored** two Management Trainee, accelerating their technical _growth and productivity_."
			],
			"achievements": [
				"Led the migration of a legacy system from traditional server system to virtulization system(VMware vSphere), Virtualization rate reaches 60%, boosting scalability and reliability.",
				"Passed the certification of ISO27001 information security management requirements",
				"Implement Hierarchical Storage Management(Include HDS SAN Storage System, IBM SAN Storage System, Dell iSCSI Storage System and  Net App NAS Storage System), Significantly reduce overall storage cost (TCO)"
			],
			"achievements_md": [
				"Led the migration of a legacy system from traditional server system to **virtulization system**(VMware vSphere), Virtualization rate reaches 60%, boosting scalability and reliability.",
				"Passed the certification of **ISO27001** information security management requirements",
				"Implement **Hierarchical Storage Management**, Significantly reduce overall storage cost (TCO), Include HDS SAN Storage System, IBM SAN Storage System, Dell iSCSI Storage System and  Net App NAS Storage System"
			],
			"skills": [
				"ITIL4",
				"ISO 27001",
				"TCO",
				"Incident Management",
				"Change Management",
				"Security Patch Management",
				"VMVare vSphere",
				"SAN Storage",
				"NAS Storage",
				"iSCSI Storage",				
				"Windows Server",
				"Linux Server"
			]
		},
		{
			"company": "Li & Fung (Shenzhen) Co., Ltd.",
			"position": "System Specialist",
			"startDate": "2008-12",
			"endDate": "2010-12",
			"summary": "Work with the Dev team on Sourcing Platform (the major business system) Deployment, Operation and Maintenance, HA Server, network, storage system etc.",
			"summary_md": "Work with the Dev team on **Sourcing Platform** (the major business system) Deployment, Operation and Maintenance, HA Server, network, storage system etc.",
			"achievements": [
				"For the Souceing Platform, overseeing the full infrastructure lifecycle—including server and storage selection, backup, and high-availability solutions—from design through daily monitoring. Collaborated closely with development teams to implement agile practices, enabling rapid, reliable iteration and accelerated version releases."
			],
			"achievements_md": [
				"For the Souceing Platform, overseeing the full infrastructure lifecycle—including server and storage selection, backup, and high-availability solutions—from design through daily monitoring. Collaborated closely with development teams to implement agile practices, enabling rapid, reliable iteration and accelerated version releases."
			]

		},
		{
			"company": "RTSourcing Shenzhen Ltd.",
			"position": "IT Manager (China)",
			"startDate": "2000-04",
			"endDate": "2008-12",
			"summary": "During this time, the company grew from 50 to more than 500 people, and I also grew to the head of the company's IT department.",
			"summary_md": "During this time, the company grew from 50 to more than 500 people, and I also grew to the head of the company's IT department.",
			"achievements": [
				" I built the company's IT system from scratch, including the network system, server system, storage system, security system, OA system, and business system. I also led a team to maintain the company's IT system and provide technical support to the company's employees."
			],
			"achievements_md": [
				" I built the company's IT system from scratch, including the network system, server system, storage system, security system, OA system, and business system. I also led a team to maintain the company's IT system and provide technical support to the company's employees."
			]

		}
	],
	"education": [
		{
			"institution": "Zhejiang University",
			"area": " Computer Science and Technology, B.S",
			"startDate": "2011-09",
			"endDate": "2015-02",
			"highlights": [
				"Essential theories and necessary expertise in computer science and information technology related principles by connecting computer theories with applications, connecting computer software with hardware, and connecting engineering methodology with technology."
			]
		},
		{
			"institution": "Guangdong University of Foreign Studies",
			"area": "English Junior College",
			"startDate": "2004-09",
			"endDate": "2007-12",
			"highlights": [
				"Learn the foundations of composition, critical thinking, and research in this English degree program designed to immerse you in all areas of literature and language."
			]
		}
	],
	"certificates": [
		{
			"name": "Certified Kubernetes Administrator (CKA)",
			"issuer": "The Linux Foundation",
			"date": "2025-12",
			"iconName": "skill-icons:kubernetes",
			"iconSearch": "<svg xmlns='http://www.w3.org/2000/svg' width='256' height='256' viewBox='0 0 256 256'><g fill='none'><rect width='256' height='256' fill='#326ce5' rx='60'/><path fill='#fff' stroke='#fff' stroke-width='0.11' d='M128.073 30a6.014 6.014 0 0 0-5.589 6.314v1.605c.153 1.817.426 3.617.785 5.4a53 53 0 0 1 .563 10.326a6.23 6.23 0 0 1-1.86 2.943l-.128 2.407c-3.456.29-6.886.819-10.265 1.587a73.1 73.1 0 0 0-37.153 21.204l-2.047-1.45a4.42 4.42 0 0 1-3.37-.342a53 53 0 0 1-7.655-6.912a47 47 0 0 0-3.729-3.967l-1.263-1.007a6.82 6.82 0 0 0-3.95-1.493a5.46 5.46 0 0 0-4.531 2.013a6.02 6.02 0 0 0 1.4 8.388l1.177.939a47 47 0 0 0 4.71 2.756a49 49 0 0 1 8.516 5.973a6.3 6.3 0 0 1 1.134 3.276l1.86 1.707a73.54 73.54 0 0 0-11.587 51.248l-2.39.683a7.8 7.8 0 0 1-2.44 2.457a53 53 0 0 1-10.188 1.681a48 48 0 0 0-5.46.427l-1.511.341h-.17a5.716 5.716 0 0 0-4.791 6.924a5.7 5.7 0 0 0 1.488 2.736a5.72 5.72 0 0 0 5.836 1.407h.111l1.536-.17a46 46 0 0 0 5.103-1.86a53 53 0 0 1 9.915-2.901a6.2 6.2 0 0 1 3.26 1.151l2.56-.426a73.92 73.92 0 0 0 32.766 40.983l-1.041 2.176a5.7 5.7 0 0 1 .512 3.208a55 55 0 0 1-5.146 9.318a48 48 0 0 0-3.054 4.548l-.726 1.536a5.72 5.72 0 0 0 2.49 8.015a5.7 5.7 0 0 0 3.057.527a5.72 5.72 0 0 0 4.719-3.687l.707-1.45a47 47 0 0 0 1.639-5.205c1.51-3.729 2.33-7.731 4.394-10.206a4.6 4.6 0 0 1 2.441-1.194l1.28-2.33a73.55 73.55 0 0 0 52.443.128l1.134 2.176a4.44 4.44 0 0 1 2.902 1.749a54 54 0 0 1 3.891 9.557a48 48 0 0 0 1.655 5.214l.708 1.45a5.72 5.72 0 0 0 7.784 3.154a5.7 5.7 0 0 0 2.345-2.036a5.71 5.71 0 0 0 .136-5.981l-.742-1.536a47 47 0 0 0-3.055-4.531c-1.962-2.833-3.652-5.854-5.12-9.019a4.43 4.43 0 0 1 .581-3.414a20 20 0 0 1-.948-2.295a74.02 74.02 0 0 0 32.622-41.128l2.423.426a4.53 4.53 0 0 1 3.183-1.177c3.387.648 6.706 1.706 9.915 2.901a43 43 0 0 0 5.102 1.963c.41.111 1.007.204 1.468.315h.111a5.71 5.71 0 0 0 5.823-1.421a5.7 5.7 0 0 0 1.504-2.729a5.7 5.7 0 0 0-.151-3.111a5.72 5.72 0 0 0-4.642-3.806l-1.655-.392a48 48 0 0 0-5.461-.427a52 52 0 0 1-10.188-1.681a6.4 6.4 0 0 1-2.458-2.457l-2.304-.683a73.8 73.8 0 0 0-11.826-51.137l2.014-1.86a4.5 4.5 0 0 1 1.058-3.226a53.6 53.6 0 0 1 8.447-5.939a48 48 0 0 0 4.71-2.756l1.246-1.007a5.72 5.72 0 0 0 1.456-8.42a5.716 5.716 0 0 0-8.53-.463l-1.262 1.007a48 48 0 0 0-3.729 3.968a53.3 53.3 0 0 1-7.45 7.023a6.3 6.3 0 0 1-3.447.375l-2.159 1.536a74.55 74.55 0 0 0-47.229-22.783c0-.853-.111-2.133-.128-2.534a4.48 4.48 0 0 1-1.86-2.833a53 53 0 0 1 .648-10.3c.367-1.791.623-3.583.785-5.4v-1.707a6.01 6.01 0 0 0-5.589-6.314zm-7.117 44.08l-1.706 29.806h-.128c-.086 1.843-1.169 3.413-2.833 4.301c-1.664.887-3.635.623-5.12-.461L86.722 90.404a58.54 58.54 0 0 1 28.184-15.35a60 60 0 0 1 6.033-.973zm14.233 0a59.1 59.1 0 0 1 34.046 16.418l-24.216 17.211a5.02 5.02 0 0 1-5.274.614a5.02 5.02 0 0 1-2.867-4.471zm-57.34 27.536l22.355 19.95v.128a5.02 5.02 0 0 1 1.587 4.898a5.02 5.02 0 0 1-3.558 3.712v.085l-28.687 8.251a58.53 58.53 0 0 1 8.31-37.032zm100.286 0a59.58 59.58 0 0 1 8.55 36.922l-28.73-8.277v-.111a4.96 4.96 0 0 1-3.559-3.712a5.05 5.05 0 0 1 1.588-4.897l22.185-19.856zm-54.645 21.503h9.148l5.589 7.099l-2.031 8.875l-8.217 3.95l-8.235-3.95l-1.937-8.875zm29.302 24.216a5.3 5.3 0 0 1 1.152 0l29.584 4.992c-4.267 12.287-12.689 22.783-23.679 29.805l-11.434-27.68a5 5 0 0 1-.383-2.354a5.04 5.04 0 0 1 4.726-4.635zm-49.687.128a5.03 5.03 0 0 1 4.13 2.287a4.99 4.99 0 0 1 .401 4.693v.111l-11.365 27.459a58.7 58.7 0 0 1-23.534-29.498l29.327-4.975q.489-.051.99 0zm24.78 11.946a5.04 5.04 0 0 1 4.582 2.628h.111l14.455 26.085l-5.777 1.707a58.83 58.83 0 0 1-32.067-1.655l14.506-26.085c.879-1.536 2.5-2.475 4.267-2.518z'/></g></svg>",
			"url": "https://www.credly.com/badges/315d8b91-45b6-47ed-aa5d-02b6f8227173/public_url",
			"url_verify": "https://training.linuxfoundation.org/certification/verify/#"
		},
		{
			"name": "Alibaba Cloud Certified Professional - Cloud Computing",
			"issuer": "Alibaba Cloud",
			"date": "2025-11"
		},
		{
			"name": "Alibaba Cloud Certified Associate - Cloud Computing",
			"issuer": "Alibaba Cloud",
			"date": "2025-10"
		},
		{
			"name": "Clound Native Container Clouder",
			"issuer": "Alibaba Cloud",
			"date": "2025-10"
		},
		{
			"name": "Elastic Computing Clouder",
			"issuer": "Alibaba Cloud",
			"date": "2025-10"
		},
		{
			"name": "ISO 27001 Auditor",
			"issuer": "HKQAA",
			"date": "2011-06"
		},
		{
			"name": "MCSE",
			"issuer": "Microsoft",
			"date": "2001-12"
		}
	],
	"projects": [
		{
			"name": "Kubernetes On Premise",
			"description": "On-premises Kubernetes clusters can be isolated from the public cloud, reducing the risk of attacks. This setup also helps in meeting stringent regulatory and data privacy requirements, as data is stored and managed within the physical premises.",
			"highlights": [
				"Deploying Kubernetes on-premises offers significant benefits in terms of security, compliance, and cost-effectiveness but also presents challenges in scalability, management complexity, and networking."
			],
			"startDate": "2023-06",
			"url": "https://k8s.it-bang.cn/",
			"isActive": true,
			"skills": ["Kubernetes", "Bare-Metal", "GlusterFS","Storage-NFS", "Storage-SMB",  "metallb", "cert-manager", "harbor", "ingress-nginx", "prometheus", "grafana", "OpenTelemetry", "fluentd"],
			"hidden": false
		},
		{
			"name": "Cloud-Native AI (Alibaba Cloud)",
			"description": "Cloud-native AI provides a set of essential features and services to help clients to build an AI platform, accelerate AI workloads and simplify MLOps.",
			"highlights": [
				"A Kubernetes-based service in the modular and extensible architecture, accelerating the construction of the AI platforms and improving resource utilization and delivery efficiency."
			],
			"startDate": "2025-07",
			"url": "",
			"isActive": true,
			"skills": [
				"Alibaba Cloud",
				"Spring AI",
				"Spring AI Alibaba",
				"Agent",
				"Nacos",
				"Nacos A2A",
				"Rocket MQ",
				"AI Gateway",
				"AI Runtime",
				"AI Observability",
				"MCP",
				"Nacos MCP Registry",
				"AI Security"
			]
		},
		{
			"name": "DevOps, DevSecOps",
			"description": " integrates practices like Continuous Integration (CI), Continuous Delivery (CD), and automation to streamline the software development lifecycle.",
			"highlights": [
				"By adopting DevSecOps, organizations can achieve faster, more secure software delivery while fostering a culture of shared responsibility for security. This transformation is essential in today's fast-paced and threat-prone software development landscape."
			],
			"startDate": "2024-03",
			"endDate": "2024-06",
			"url": "https://app.it-bang.cn/tag/devops",
			"isActive": true,
			"skills": ["DevOps", "Jenkins", "ArgoCD", "Argo Workflows", "Argo Rollouts", "GitOps", "CI/CD", "Docker", "Kubernetes", "Helm", "Prometheus", "Grafana", "Loki", "OpenTelemetry", "ELK Stack"],
			"hidden": false
		},
		{
			"name": "Gitea: Git with a cup of tea Modern Open",
			"description": "Great self-hosted option that brings teams and developers high-efficiency, but easy operations from planning to production.",
			"highlights": [
				"Gitea enables the creation and management of repositories based on Git. It also makes code review incredibly easy and convenient, enhancing code quality for users and businesses."
			],
			"startDate": "2023-02",
			"url": "https://git.it-bang.cn/",
			"github": "https://about.gitea.com/",
			"isActive": true,
			"skills": ["Git", "Gitea", "Gitea Actions", "CI/CD","Kubernetes", "Helm", "ingress-nginx", "cert-manager"],
			"hidden": false
		},
		{
			"name": "GitOps with ArgoCD",
			"description": "Argo CD is a declarative, GitOps continuous delivery tool for Kubernetes.",
			"highlights": [
				"Application definitions, configurations, and environments should be declarative and version controlled. Application deployment and lifecycle management should be automated, auditable, and easy to understand."
			],
			"startDate": "2024-12",
			"endDate": "2024-12",
			"url": "https://argocd.it-bang.cn/",
			"isActive": true,
			"github": "https://argo-cd.readthedocs.io/en/stable/",
			"skills": ["Helm", "ArgoCD", "Argo Rollouts", "Ansible", "GitOps", "Kubernetes", "Prometheus", "Grafana", "Alertmanager"]
		},
		{
			"name": "SSO with Keycloak",
			"description": "Keycloak is an open-source identity and access management solution that supports Single Sign-On (SSO) for web applications and RESTful services.",
			"highlights": [
				"Implement SSO with Keycloak, providing seamless authentication across your applications."
			],
			"startDate": "2024-12",
			"endDate": "2025-05",
			"url": "https://sso.it-bang.cn/",
			"isActive": true,
			"github": "https://github.com/keycloak/keycloak/",
			"skills": ["SSO", "Keycloak", "OAuth 2.0", "OpenID Connect", "HELM", "Kubernetes", "GitHub", "Active Directory", "Azure Cloud"]
		}
	],
	"skills": [
		{
			"name": "DevOps",
			"keywords": [
				"Git",
				"Gitea",
				"Docker",
				"Kubernetes",
				"bare metal k8s cluster", 
				"ECK", "AKS", "GKS",
				"Helm",
				"Portainer",
				"Harbor",
				"Sonatype Nexus",
				"Terraform",
				"Ansible",
				"Bash Script",
				"CI/CD",
				"Argo CD",
				"Argo Workflows",
				"Argo rollouts",
				"Jenkins",
				"GitLab CI/CD",
				"GitHub Actions",
				"Observability",
				"Promitheus",
				"Grafana",
				"Loki",
				"OpenTelemetry",
				"ELK Stack",
				"Elaticsearch",
				"Logstash",
				"Kibana",
				"Fluentd"
		
			]
		},
		{
			"name": "Cloud Computing",
			"keywords": [
				"AWS",
				"Google Cloud",
				"Azure Cloud",
				"Alibaba Cloud",
				"Tencent Cloud"
			]
		},
		{
			"name": "Backend",
			"keywords": [
				"Java",
				"Spirng Framework",
				"Microservices",
				"Spring Boot",
				"Spring Cloud",
				"Spring Data JPA",
				"Spring Security",
				"Spring MVC",
				"Spring AOP",
				"Spring Cloud Gateway",
				"Spring Cloud Alibaba",
				"Spring AI",
				"Spring AI Alibaba",
				"MCP",
				"REST"
			]
		},
		{
			"name": "Frontend",
			"keywords": [
				"Aastro Web Framework",
				"WordPress",
				"Angular",
				"Vite",
				"TypeScript",
				"JavaScript",
				"Bootstrap",
				"NG-Alain",
				"Tailwind CSS",
				"CSS",
				"HTML",
				"SPA",
				"SSG",
				"SEO"
			]
		},
		{
			"name": "Database",
			"keywords": ["SQL", "ORM", "JPA", "MySQL", "PostgreSQL", "NoSQL", "MongoDB", "Redis"]
		},
		{
			"name": "Testing",
			"keywords": [
				"JUnit",
				"TestNG",
				"AssertJ",
				"Mokito",
				"Spring Boot Test",
				"Jasmine",
				"Jest",
				"Postman",
				"TDD"
			]
		},

		{
			"name": "Collaboration",
			"keywords": ["Git", "Agile", "Jira", "Teams", "Zoom", "Feishu"]
		},
		{
			"name": "OS",
			"keywords": ["Linux", "MacOS", "Windows"]
		},
		{
			"name": "Misc",
			"keywords": ["Kafka", "Rocket MQ","Regex", "Markdown", "MDX", "CLI"]
		}
	],
	"languages": [
		{
			"language": "Chinese",
			"fluency": "Native speaker"
		},
		{
			"language": "English",
			"fluency": "Professional working proficient"
		},
		{
			"language": "Cantonese",
			"fluency": "Native speaker"
		}
	],
	"interests": [
		{
			"name": "Hiking"
		},
		{
			"name": "Running"
		},
		{
			"name": "Reading"
		}
	]
}
